eidsrv-testbed-testgenerator/src/main/resources/steps/OUT_START_PAOS_DIDPROTOCOLS.xml

<?xml version="1.0" encoding="UTF-8"?>
<p:Step xmlns:p="http://www.secunet.com"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://www.secunet.com ../xmlScheme/sn_TestcaseDefinition.xsd" >
	<p:TargetInterface>eCard-API</p:TargetInterface>
    <p:HttpStepToken>
        <p:name>header</p:name>
        <p:value><![CDATA[POST [CANDIDATE_PATH] HTTP/1.1
Host: [CANDIDATE_HOSTNAME]
User-Agent: [TESTBED_USER_AGENT_NAME]/[TESTBED_USER_AGENT_MAJOR].[TESTBED_USER_AGENT_MINOR].[TESTBED_USER_AGENT_SUBMINOR]
Connection: keep-alive
Accept: text/html; application/vnd.paos+xml
PAOS: ver=&quot;urn:liberty:paos:2006-08&quot;
Content-Type: application/vnd.paos+xml; charset=UTF-8
Content-Length: [[CHARLENGTH]]
requestid: [SESSIONIDENTIFIER]]]></p:value>
		<p:isMandatory>true</p:isMandatory>
	</p:HttpStepToken>
	<p:ProtocolStepToken>
		<p:name>message</p:name>
		<p:value><![CDATA[&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:dss=&quot;urn:oasis:names:tc:dss:1.0:core:schema&quot; xmlns:ecard=&quot;http://www.bsi.bund.de/ecard/api/1.1&quot; xmlns:iso=&quot;urn:iso:std:iso-iec:24727:tech:schema&quot; xmlns:paos=&quot;urn:liberty:paos:2006-08&quot; xmlns:wsa=&quot;http://www.w3.org/2005/03/addressing&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soap:Header&gt;&lt;paos:PAOS soap:actor=&quot;http://schemas.xmlsoap.org/soap/actor/next&quot; soap:mustUnderstand=&quot;1&quot;&gt;&lt;paos:Version&gt;urn:liberty:paos:2006-08&lt;/paos:Version&gt;&lt;paos:EndpointReference&gt;&lt;paos:Address&gt;http://www.projectliberty.org/2006/01/role/paos&lt;/paos:Address&gt;&lt;paos:MetaData&gt;&lt;paos:ServiceType&gt;http://www.bsi.bund.de/ecard/api/1.1/PAOS/GetNextCommand&lt;/paos:ServiceType&gt;&lt;/paos:MetaData&gt;&lt;/paos:EndpointReference&gt;&lt;/paos:PAOS&gt;&lt;wsa:ReplyTo&gt;&lt;wsa:Address&gt;http://www.projectliberty.org/2006/02/role/paos&lt;/wsa:Address&gt;&lt;/wsa:ReplyTo&gt;&lt;wsa:MessageID&gt;urn:uuid:[[UUID]]&lt;/wsa:MessageID&gt;&lt;/soap:Header&gt;&lt;soap:Body&gt;&lt;StartPAOS xmlns=&quot;urn:iso:std:iso-iec:24727:tech:schema&quot;&gt;&lt;SessionIdentifier&gt;[SESSIONIDENTIFIER]&lt;/SessionIdentifier&gt;&lt;ConnectionHandle xsi:type=&quot;ConnectionHandle&quot;&gt;&lt;CardApplication&gt;E80704007F00070302&lt;/CardApplication&gt;&lt;SlotHandle&gt;36333334&lt;/SlotHandle&gt;&lt;/ConnectionHandle&gt;&lt;UserAgent&gt;&lt;Name&gt;[TESTBED_USER_AGENT_NAME]&lt;/Name&gt;&lt;VersionMajor&gt;[TESTBED_USER_AGENT_MAJOR]&lt;/VersionMajor&gt;&lt;VersionMinor&gt;[TESTBED_USER_AGENT_MINOR]&lt;/VersionMinor&gt;&lt;VersionSubminor&gt;[TESTBED_USER_AGENT_SUBMINOR]&lt;/VersionSubminor&gt;&lt;/UserAgent&gt;&lt;SupportedAPIVersions&gt;&lt;Major&gt;1&lt;/Major&gt;&lt;Minor&gt;1&lt;/Minor&gt;&lt;Subminor&gt;4&lt;/Subminor&gt;&lt;/SupportedAPIVersions&gt;&lt;iso:SupportedDIDProtocols&gt;urn:oid:1.3.162.15480.3.0.14&lt;/iso:SupportedDIDProtocols&gt;&lt;iso:SupportedDIDProtocols&gt;urn:oid:1.3.162.15480.3.0.14.2&lt;/iso:SupportedDIDProtocols&gt;&lt;iso:SupportedDIDProtocols&gt;urn:oid:1.3.162.15480.3.0.25&lt;/iso:SupportedDIDProtocols&gt;&lt;iso:SupportedDIDProtocols&gt;urn:oid:1.3.162.15480.3.0.9&lt;/iso:SupportedDIDProtocols&gt;&lt;/StartPAOS&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;]]></p:value>
		<p:isMandatory>true</p:isMandatory>
	</p:ProtocolStepToken>
</p:Step>